## Plan Result (765: sbox_shutter_webapp - TerraformPlanApply)




<pre><code>Plan: 5 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;labs-goldenpath-mano&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;labs-goldenpath-mano&#34;]
  * module.static_webapp.azurerm_static_site.swebapp[&#34;labs-goldenpath-mano&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;labs-goldenpath-mano&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;labs-goldenpath-mano&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.static_webapp.azurerm_dns_cname_record.cname_record["labs-goldenpath-mano"] will be created
  + resource "azurerm_dns_cname_record" "cname_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "labs-goldenpath-mano-shutter"
      + record              = (known after apply)
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.static_webapp.azurerm_dns_txt_record.zone_validate["labs-goldenpath-mano"] will be created
  + resource "azurerm_dns_txt_record" "zone_validate" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.labs-goldenpath-mano"
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 3600
      + zone_name           = "sandbox.platform.hmcts.net"

      + record {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.static_webapp.azurerm_static_site.swebapp["labs-goldenpath-mano"] will be created
  + resource "azurerm_static_site" "swebapp" {
      + api_key             = (sensitive value)
      + default_host_name   = (known after apply)
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "labs-goldenpath-mano"
      + resource_group_name = "cft-platform-shutter-webapp-sbox-rg"
      + sku_size            = "Standard"
      + sku_tier            = "Standard"
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }
    }

  # module.static_webapp.azurerm_static_site_custom_domain.custom_domain["labs-goldenpath-mano"] will be created
  + resource "azurerm_static_site_custom_domain" "custom_domain" {
      + domain_name      = "labs-goldenpath-mano.sandbox.platform.hmcts.net"
      + id               = (known after apply)
      + static_site_id   = (known after apply)
      + validation_token = (sensitive value)
      + validation_type  = "dns-txt-token"
    }

  # module.static_webapp.github_actions_secret.secret["labs-goldenpath-mano"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "azure-shutter-pages"
      + secret_name     = "labs_goldenpath_mano_sbox"
      + updated_at      = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ debug_shutter = [
        # (1 unchanged element hidden)
        {
            backend_domain   = [
                "firewall-sbox-int-palo-sbox.uksouth.cloudapp.azure.com",
            ]
            certificate_name = "wildcard-sandbox-platform-hmcts-net"
            custom_domain    = "plumclassic.sandbox.platform.hmcts.net"
            disabled_rules   = {}
            dns_zone_name    = "sandbox.platform.hmcts.net"
            name             = "plumclassic"
            product          = "plumclassic"
            shutter_app      = true
            ssl_mode         = "AzureKeyVault"
        },
      + {
          + backend_domain   = [
              + "firewall-sbox-int-palo-labsgoldenpathmano.uksouth.cloudapp.azure.com",
            ]
          + certificate_name = "wildcard-sandbox-platform-hmcts-net"
          + custom_domain    = "labs-goldenpath-mano.sandbox.platform.hmcts.net"
          + disabled_rules   = {}
          + dns_zone_name    = "sandbox.platform.hmcts.net"
          + name             = "labs-goldenpath-mano"
          + product          = "labs-goldenpath-mano"
        },
    ]
```

</details>





## :warning: Errors

* add a label 765: sbox_shutter_webapp - TerraformPlanApply/add-or-update: POST https://api.github.com/repos/hmcts/azure-platform-terraform/issues/2542/labels: 422 Validation Failed [{Resource:Label Field:name Code:invalid Message:}]
<!-- github-comment: {"Command":"plan","PRNumber":2542,"Program":"tfcmt","SHA1":"","Target":"765: sbox_shutter_webapp - TerraformPlanApply","Vars":{}} -->